hw4_rottenpotatoes-master/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def same_director

    @movie = Movie.find params[:id]
    if @movie.director.nil? || @movie.director.empty?